package com.baoke.sms.constant;

/**
 * wyj
 */
public enum YunTongXunSmsCode {

    SUCCESS("000000","发送成功"),
    NULL_PHONE_NUM("112300","【短信】接收短信的手机号码为空"),
    NULL_MESSAGE("112301","【短信】短信正文为空"),
    PAUSE("112302","【短信】群发短信已暂停"),
    NOT_ALLOWED("112303","【短信】应用未开通短信功能"),
    ILLEGAL_CHARSET("112304","【短信】短信内容的编码转换有误"),
    LIMIT("112305","【短信】应用未上线，短信接收号码外呼受限"),
    NULL_SOURCE("112306","【短信】接收模板短信的手机号码为空"),
    NULL_TEMP("112307","【短信】模板短信模板ID为空"),
    NULL_DATA("112308","【短信】模板短信模板data参数为空"),
    ILLEGAL_TEMP_CHARSET("112309","【短信】模板短信内容的编码转换有误"),
    ERRO1("112310","【短信】应用未上线，模板短信接收号码外呼受限"),
    ERRO2("112311","【短信】短信模板不存在"),
    ERRO3("112312","【短信】应用未配置此短信扩展码"),
    ERRO4("112313","【短信】未查到符合条件的短信模板"),
    ERRO5("112313","【短信】未查到符合条件的短信模板"),
    ERRO6("112313","【短信】未查到符合条件的短信模板"),
    ERRO7("112314","【短信】短信下发超过当日发送限制"),
    ERR08("112315","【短信】短信模板ID长度超长"),
    ERR09("112316","【短信】接收短信的多个号码格式错误"),
    ERR10("112317","【短信】号码在黑名单中"),
    ERR11("112318","【短信】短信模板ID要求为数字"),
    ERR12("112319","【短信】接收短信的手机号码超长"),
    ERR13("112320","【短信】用户未配置接收上行短信及回执的回调地址"),
    ERR14("112321","【短信】用户未勾选接收上行短信及回执"),
    ERR15("112323","【短信】短信模板不存在或审核未通过"),
    ERR16("112324","【短信】日期不能为空"),
    ERR17("112325","【短信】msgId不能为空"),
    ERR18("112326","【短信】发送短信失败"),
    ERR19("112327","【短信】日期参数含有非法字符"),
    ERR20("112328","【短信】电话号码参数含有非法字符"),
    ERR21("112329","【短信】获取短信状态报告count参数不正确"),
    ERR22("112330","【短信】获取短信状态报告count参数超过最大限制"),
    ERR23("112341","【短信】短信模板产品类型不能为空"),
    ERR25("112342","【短信】rest接口生成短信模板时产品类型仅支持已发布应用和网页"),
    ERR26("112343","【短信】短信模板标题不能为空"),
    ERR27("112344","【短信】短信模板签名不能为空"),
    ERR28("112345","【短信】短信模板内容不能为空"),
    ERR29("112346","【短信】短信模板签名必须大于3个字小于8个字"),
    ERR30("112347","【短信】短信模板签名必须带有中文"),
    ERR31("112348","【短信】短信模板产品地址不能为空"),
    ERR32("112349","【短信】账户必须企业认证"),
    ERR33("112350","【短信】账户必须累计充值2000元以上或购买任一短信包"),
    ERR34("112351","【短信】短信状态不存在"),
    ERR35("112352","【短信】短信状态已过期"),
    ERR36("112353","【短信】应用不属于该主账号"),
    ERR37("112354","【短信】查询超过并发次数"),
    ERR38("113302","【短信】您正在使用云通讯测试模板且短信接收者不是注册的测试号码"),
    ERR39("160001","【短信】短信通道繁忙"),
    ERR40("160011","【短信】存在屏蔽词的词汇，目前模板短信都没有校验屏蔽词"),
    ERR41("160012","【短信】短信通道认证出错"),
    ERR42("160013","【短信】号码格式不对，或者该号码不支持"),
    ERR43("160014","【短信】短信通道余额不足"),
    ERR44("160015","【短信】限制对单号码的发送次数"),
    ERR45("160016","【短信】通道限制发送速度"),
    ERR46("160017","【短信】单次提交号码过多。天天限制是100个"),
    ERR47("160018","【短信】短信通道返回有屏蔽词"),
    ERR48("160019","【短信】签名无效"),
    ERR49("160020","【短信】短信内容过长。天天限制是250个字符"),
    ERR50("160021","【短信】相同的内容发给同一手机一天中只能发一次"),
    ERR51("160022","【短信】对同一个手机一天发送的短信超过限制次数"),
    ERR52("160031","【短信】参数解析失败"),
    ERR53("160032","【短信】短信模板无效"),
    ERR54("160033","【短信】短信存在黑词"),
    ERR55("160034","【短信】号码黑名单"),
    ERR56("160035","【短信】短信下发内容为空"),
    ERR57("160036","【短信】短信模板类型未知"),
    ERR58("160037","【短信】短信内容长度限制"),
    ERR59("160038","【短信】短信验证码发送过频繁"),
    ERR60("160039","【短信】发送数量超出同模板同号天发送次数上限"),
    ERR61("160040","【短信】验证码超出同模板同号码天发送上限"),
    ERR62("160041","【短信】通知超出同模板同号码天发送上限"),
    ERR63("160042","【短信】号码格式有误"),
    ERR64("160043","【短信】应用与模板id不匹配"),
    ERR65("160044","【短信】发送号码为空"),
    ERR66("160045","【短信】群发号码重复"),
    ERR67("160046","【短信】营销短信发送内容审核未通过"),
    ERR68("160047","【短信】询状态报告包体解析失败"),
    ERR69("160048","【短信】号码数超200限制"),
    ERR70("160049","【短信】短信内容含敏感词"),
    ERR71("160051","【短信】营销退订号码"),
    ERR72("160052","【短信】模板变量格式有误"),
    ERR73("160053","【短信】IP鉴权失败"),
    ERR74("160054","【短信】请求重复"),
    ERR75("160055","【短信】请求reqId超长"),
    ERR76("160056","【短信】同号码请求内容重复"),
    ERR77("160057","【短信】短信模板ID要求为数字"),
    ERR78("160058","【短信】账户无国际短信权限"),
    ERR79("160059","【短信】国际短信暂不支持群发"),
    ERR80("160060","【短信】国际短信账户无营销短信权限"),
    ERR81("160061","【短信】暂不支持的国家码号"),
    ERR82("160062","【短信】未开通此国家码号"),
    ERR83("160063","【短信】短信发送失败"),
    ERR84("160064","【短信】短信发送失败"),
    ERR85("160065","【短信】子扩展不符合要求"),
    ERR86("161000","渠道返回失败"),
    ERR87("161001","渠道调用异常"),
    ERR88("161002","渠道账户余额不足"),
    ERR89("161003","短信计费失败"),
    ERR90("161004","短信记录入库失败"),
    ERR91("161005","未配置可用通道"),
    ERR92("161006","超出通道最大并发数"),
    ERR93("161007","短信内容通道敏感"),
    ERR94("161008","DB访问异常"),
    ERR95("161009","RDS访问异常"),
    ERR96("161010","RDS连接失败"),
    ERR97("161011","RDS超过最大连接数"),
    ERR98("161012","DB超过最大连接数"),
    ERR99("161020","直连通道HTTP连接超时"),
    ERR100("161021","直连通道HTTP读取超时"),
    ERR101("161022","直连通道HTTP请求异常"),
    ERR102("161023","直连通道响应空包体"),
    ERR103("161024","直连通道响应发送失败"),
    ERR104("161030","状态报告推送异常"),
    ERR105("161031","上线短信推送异常"),
    ERR106("161100","鉴权失败"),
    ERR107("161101","请求包头Authorization参数为空"),
    ERR108("161102","请求包头Authorization参数Base64解码失败"),
    ERR109("161103","请求包头Authorization参数解码后格式有误"),
    ERR110("161104","请求包头Authorization参数解码后token为空"),
    ERR111("161105","请求包头Authorization参数解码后时间戳为空"),
    ERR112("161106","请求包头Authorization参数解码后时间戳过期"),
    ERR113("161107","请求包头Authorization参数中时间戳错误"),
    ERR114("161108","请求包头Authorization参数解码后时间戳格式有误"),
    ERR115("112357","【短信】短信模板签名长度必须在2-16个字之间"),
    ERR116("160002","【短信】短信模板签名长度必须在2-16个字之间"),
    ERR117("160003","【短信】短信模板签名长度必须在2-16个字之间"),
    ERR118("160004","【短信】短信模板签名长度必须在2-16个字之间"),
    ERR119("160005","【短信】短信模板签名长度必须在2-16个字之间"),
    ERR120("160006","【短信】短信模板签名长度必须在2-16个字之间"),
    ERR121("160007","【短信】短信模板签名长度必须在2-16个字之间"),
    ERR122("160008","【短信】短信模板签名长度必须在2-16个字之间"),
    ERR123("160009","【短信】短信模板签名长度必须在2-16个字之间"),
    ERR124("160010","【短信】短信模板签名长度必须在2-16个字之间"),
    ERR125("-1","未知错误");

    private final String code;
    private final String name;


    YunTongXunSmsCode(String code, String name){
        this.code = code;
        this.name = name;
    }

    public static YunTongXunSmsCode getDesc(String code)
    {
        for(YunTongXunSmsCode sms: YunTongXunSmsCode.values())
        {
            if (sms.code.equals(code))
            {
                return sms;
            }
        }
        return ERR125;
    }

    public String getCode(){
        return code;
    }

	public String getName() {
		return name;
	}
   

}
